# Shell & Prompt
brew "zsh"
brew "powerlevel10k"

# Terminal
brew "kitty"

# Editor and Pager
brew "neovim"
brew "git-delta"

# File Management & Search
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "zoxide"
brew "ripgrep"
brew "tealdeer"

# Multiplexer
brew "tmux"

# Git
brew "git"
brew "pre-commit"
brew "gh"

# Downloads & Media
brew "aria2"
brew "yt-dlp"
brew "mpv"

# Cloud & Backup
brew "rclone"
brew "borgbackup"

# Dev Tools
brew "yamllint"
brew "direnv"
brew "stow"

# macOS
cask "karabiner-elements"
